# LineSegment Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LineSegment Properties
LineSegment Class See Also
---
The LineSegment type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EndParameter | Parameter associated with the end point. |
| EndPoint | End point of the line segment. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LineProperties | Access to the line (pen) properties of the line |
| StartParameter | Parameter associated with the start point. |
| StartPoint | Start point of the line segment. |

# See Also
LineSegment Class
Autodesk.Revit.DB Namespace